synthetos/Motate/MotateProject/motate/Atmel_sam4e/SamUART.h
/*
 SamUART.h - Library for the Motate system
 http://github.com/synthetos/motate/

 Copyright (c) 2016 Robert Giseburt

 This file is part of the Motate Library.

 This file ("the software") is free software: you can redistribute it and/or modify
 it under the terms of the GNU General Public License, version 2 as published by the
 Free Software Foundation. You should have received a copy of the GNU General Public
 License, version 2 along with the software. If not, see <http://www.gnu.org/licenses/>.

 As a special exception, you may use this file as part of a software library without
 restriction. Specifically, if other files instantiate templates or use macros or
 inline functions from this file, or you compile this file and link it with  other
 files to produce an executable, this file does not by itself cause the resulting
 executable to be covered by the GNU General Public License. This exception does not
 however invalidate any other reasons why the executable file might be covered by the
 GNU General Public License.

 THE SOFTWARE IS DISTRIBUTED IN THE HOPE THAT IT WILL BE USEFUL, BUT WITHOUT ANY
 WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT
 SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF
 OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

 */

#ifndef SAM4XUART_H_ONCE
#define SAM4XUART_H_ONCE

#include <MotatePins.h>
#include <MotateBuffer.h>
#include <type_traits>
#include <algorithm> // for std::max, etc.
#include <functional>

#include "sam.h"

// Damn C defines. UART is a DEFINE, so we can't use it as an object type.
// We will undefine it here.
// Damn defines anyway
//#define UART0_DONT_CONFLICT UART0
//#undef UART0
//#ifdef UART1
//#define UART1_DONT_CONFLICT UART1
//#undef UART1
//#endif

//extern typename decltype(UART_DONT_CONFLICT) UART;

namespace Motate {


/* HERE we do a stupid anti-#define dance, since these defines screw EVERYTHING up */

#ifdef UART0
    // This is for the Sam4e
    constexpr Uart * const UART0_DONT_CONFLICT = UART0;
    #undef UART0
    constexpr Uart * const UART0 = UART0_DONT_CONFLICT;
    #define HAS_UART0

    constexpr uint16_t const ID_UART0_DONT_CONFLICT = ID_UART0;
    #undef ID_UART0
    constexpr uint16_t const ID_UART0 = ID_UART0_DONT_CONFLICT;

#else
#ifdef UART

    // This is for the Sam3x
    constexpr Uart * const UART0_DONT_CONFLICT = UART;
    #undef UART
    constexpr Uart * const UART0 = UART0_DONT_CONFLICT;
    #define HAS_UART0

    constexpr Uart * const UART1 = nullptr;
    constexpr uint32_t ID_UART0 = ID_UART;
    #undef ID_UART
    constexpr uint32_t ID_UART1 = 0;

    constexpr IRQn_Type UART0_IRQn = UART_IRQn;
    constexpr IRQn_Type UART1_IRQn = (IRQn_Type)0u;
#endif
#endif

#ifdef UART1
    Uart * const UART1_DONT_CONFLICT = UART1;
    #undef UART1
    Uart * const UART1 = UART1_DONT_CONFLICT;
    #define HAS_UART1

    constexpr uint32_t const ID_UART1_DONT_CONFLICT = ID_UART1;
    #undef ID_UART1
    constexpr uint32_t const ID_UART1 = ID_UART1_DONT_CONFLICT;
#endif

#ifdef USART0
    // Thi isn't strictly necessary, but preventative and for consistency.
    Usart * const USART0_DONT_CONFLICT = USART0;
    #undef USART0
    Usart * const USART0 = USART0_DONT_CONFLICT;
    #define HAS_USART0

    constexpr uint32_t const ID_USART0_DONT_CONFLICT = ID_USART0;
    #undef ID_USART0
//    constexpr uint32_t const ID_USART0 = ID_USART0_DONT_CONFLICT;
#endif

#ifdef USART1
    // Thi isn't strictly necessary, but preventative and for consistency.
    Usart * const USART1_DONT_CONFLICT = USART1;
    #undef USART1
    Usart * const USART1 = USART1_DONT_CONFLICT;
    #define HAS_USART1

    constexpr uint32_t const ID_USART1_DONT_CONFLICT = ID_USART1;
    #undef ID_USART1
//    constexpr uint32_t const ID_USART1 = ID_USART1_DONT_CONFLICT;
#endif

    struct UARTMode {

        static constexpr uint16_t NoParity           =      0; // Default
        static constexpr uint16_t EvenParity         = 1 << 0;
        static constexpr uint16_t OddParity          = 1 << 1;

        static constexpr uint16_t OneStopBit         =      0; // Default
        static constexpr uint16_t TwoStopBits        = 1 << 2;

        static constexpr uint16_t As8Bit             =      0; // Default
        static constexpr uint16_t As9Bit             = 1 << 3;
//        static constexpr uint16_t As10Bit            = 1 << 4;

        // Some careful hand math will show that 8N1 == 0
        static constexpr uint16_t As8N1              = As8Bit | NoParity | OneStopBit;

        static constexpr uint16_t RTSCTSFlowControl  = 1 << 5;
        static constexpr uint16_t XonXoffFlowControl = 1 << 6;

        // TODO: Add polarity inversion and bit reversal options
    };

    struct UARTInterrupt {
        static constexpr uint16_t Off              = 0;
        /* Alias for "off" to make more sense
         when returned from setInterruptPending(). */
        static constexpr uint16_t Unknown           = 0;

        static constexpr uint16_t OnTxReady         = 1<<1;
        static constexpr uint16_t OnTransmitReady   = 1<<1;
        static constexpr uint16_t OnTxDone          = 1<<1;
        static constexpr uint16_t OnTransmitDone    = 1<<1;

        static constexpr uint16_t OnRxReady         = 1<<2;
        static constexpr uint16_t OnReceiveReady    = 1<<2;
        static constexpr uint16_t OnRxDone          = 1<<2;
        static constexpr uint16_t OnReceiveDone     = 1<<2;

        static constexpr uint16_t OnTxTransferDone  = 1<<3;
        static constexpr uint16_t OnRxTransferDone  = 1<<4;

        /* Set priority levels here as well: */
        static constexpr uint16_t PriorityHighest   = 1<<5;
        static constexpr uint16_t PriorityHigh      = 1<<6;
        static constexpr uint16_t PriorityMedium    = 1<<7;
        static constexpr uint16_t PriorityLow       = 1<<8;
        static constexpr uint16_t PriorityLowest    = 1<<9;

        /* These are for internal use only: */
        static constexpr uint16_t OnCTSChanged      = 1<<10;

