synthetos/Motate/MotateProject/motate/Atmel_sam4e/SamUART.h
    };

    // Convenience template classes for specialization:

    template<pin_number rxPinNumber, pin_number txPinNumber>
    using IsValidUART = typename std::enable_if<
        IsUARTRxPin<rxPinNumber>() &&
        IsUARTTxPin<txPinNumber>() &&
        rxPinNumber != txPinNumber &&
        UARTTxPin<txPinNumber>::moduleId == UARTRxPin<rxPinNumber>::moduleId
	>::type;

    static const char kUARTXOn  = 0x11;
    static const char kUARTXOff = 0x13;

    enum class USART_MODE_t : uint32_t {
        USART_NORMAL    = 0x0 << US_MR_USART_MODE_Pos,
        RS485           = 0x1 << US_MR_USART_MODE_Pos,
        HW_HANDSHAKING  = 0x2 << US_MR_USART_MODE_Pos,
        IS07816_T_0     = 0x4 << US_MR_USART_MODE_Pos,
        IS07816_T_1     = 0x5 << US_MR_USART_MODE_Pos,
        IRDA            = 0x8 << US_MR_USART_MODE_Pos,
        LIN_MASTER      = 0xA << US_MR_USART_MODE_Pos,
        LIN_SLAVE       = 0xB << US_MR_USART_MODE_Pos,
        SPI_MASTER      = 0xE << US_MR_USART_MODE_Pos,
        SPI_SLAVE       = 0xF << US_MR_USART_MODE_Pos
    };

    enum class USCLKS_t : uint32_t {
        MCK = 0x0 << US_MR_USCLKS_Pos,
        DIV = 0x1 << US_MR_USCLKS_Pos,
        SCK = 0x3 << US_MR_USCLKS_Pos
    };

    enum class CHRL_t : uint32_t  {
        CH_5_BIT = 0x0 << US_MR_CHRL_Pos,
        CH_6_BIT = 0x1 << US_MR_CHRL_Pos,
        CH_7_BIT = 0x2 << US_MR_CHRL_Pos,
        CH_8_BIT = 0x3 << US_MR_CHRL_Pos
    };

    enum class PAR_t : uint32_t {
        EVEN        = 0x0 << US_MR_PAR_Pos,
        ODD         = 0x1 << US_MR_PAR_Pos,
        SPACE       = 0x2 << US_MR_PAR_Pos,
        MARK        = 0x3 << US_MR_PAR_Pos,
        NO          = 0x4 << US_MR_PAR_Pos,
        MULTIDROP   = 0x6 << US_MR_PAR_Pos
    };

    enum class NBSTOP_t : uint32_t {
        STOP_1_BIT      = 0x0 << US_MR_NBSTOP_Pos,
        STOP_1_5_BIT    = 0x1 << US_MR_NBSTOP_Pos,
        STOP_2_BIT      = 0x2 << US_MR_NBSTOP_Pos
    };

    enum class CHMODE_t : uint32_t {
        CHMODE_NORMAL       = 0x0 << US_MR_CHMODE_Pos,
        AUTOMATIC           = 0x1 << US_MR_CHMODE_Pos,
        LOCAL_LOOPBACK      = 0x2 << US_MR_CHMODE_Pos,
        REMOTE_LOOPBACK     = 0x3 << US_MR_CHMODE_Pos
    };

    // USART peripherals
    template<uint8_t uartPeripheralNumber>
    struct _USARTHardware {

        static constexpr Usart * const usart() {
            return (uartPeripheralNumber == 0) ? USART0 : USART1;
        };
        static constexpr uint32_t peripheralId() {
            return (uartPeripheralNumber == 0) ? ID_USART0_DONT_CONFLICT : ID_USART1_DONT_CONFLICT;
        };
        static constexpr IRQn_Type usartIRQ() {
            return (uartPeripheralNumber == 0) ? USART0_IRQn : USART1_IRQn;
        };

        static constexpr const uint8_t uartPeripheralNum=uartPeripheralNumber;

        typedef _USARTHardware<uartPeripheralNumber> this_type_t;
        

        static std::function<void(uint16_t)> _uartInterruptHandler;

        void init() {
            // init is called once after reset, so clean up after a reset
            SamCommon::enablePeripheralClock(peripheralId());

            // Reset and disable TX and RX
            usart()->US_CR = US_CR_RSTRX | US_CR_RSTTX | US_CR_RXDIS | US_CR_TXDIS;

            // reset PCR to zero
            usart()->US_IDR = 0xffffffff; // disable all the things
            usart()->US_PTCR = UART_PTCR_RXTDIS | UART_PTCR_TXTDIS; // disable all the things
            usart()->US_RPR = 0;
            usart()->US_RNPR = 0;
            usart()->US_RCR = 0;
            usart()->US_RNCR = 0;
            usart()->US_TPR = 0;
            usart()->US_TNPR = 0;
            usart()->US_TCR = 0;
            usart()->US_TNCR = 0;
        };

        _USARTHardware() {
            // We DON'T init here, because the optimizer is fickle, and will remove this whole area.
            // Instead, we call init from UART<>::init(), so that the optimizer will keep it.
        };

        void enable() { usart()->US_CR = US_CR_TXEN | US_CR_RXEN; };
        void disable () { usart()->US_CR = US_CR_TXDIS | US_CR_RXDIS; };

        void setOptions(const uint32_t baud, const uint16_t options, const bool fromConstructor=false) {
            disable();

            // Oversampling is either 8 or 16. Depending on the baud, we may need to select 8x in
            // order to get the error low.

            // For all of the speeds up to and including 230400, 16x multiplier worked fine in testing.
            // All yielded a <1% error in final baud.
            usart()->US_BRGR = US_BRGR_CD((((SystemCoreClock * 10) / (16 * baud)) + 5)/10) | US_BRGR_FP(0);
            usart()->US_MR &= ~US_MR_OVER;


            if (options & UARTMode::RTSCTSFlowControl) {
                usart()->US_MR = (usart()->US_MR & ~US_MR_USART_MODE_Msk) | US_MR_USART_MODE_HW_HANDSHAKING;
            } else {
                usart()->US_MR = (usart()->US_MR & ~US_MR_USART_MODE_Msk) | US_MR_USART_MODE_NORMAL;
            }

            if (options & UARTMode::TwoStopBits) {
                usart()->US_MR = (usart()->US_MR & ~(US_MR_NBSTOP_Msk)) | US_MR_NBSTOP_2_BIT;
            } else {
                usart()->US_MR = (usart()->US_MR & ~(US_MR_NBSTOP_Msk)) | US_MR_NBSTOP_1_BIT;
            }

            if (options & UARTMode::As9Bit) {
                usart()->US_MR |= US_MR_MODE9;
            } else {
                usart()->US_MR = (usart()->US_MR & ~(US_MR_MODE9|US_MR_CHRL_Msk)) | static_cast<uint32_t>(CHRL_t::CH_8_BIT);
            }
            if (options & UARTMode::EvenParity) {
                usart()->US_MR = (usart()->US_MR & ~(US_MR_PAR_Msk)) | US_MR_PAR_EVEN;
            } else if (options & UARTMode::OddParity) {
                usart()->US_MR = (usart()->US_MR & ~(US_MR_PAR_Msk)) | US_MR_PAR_ODD;
            } else {
                usart()->US_MR = (usart()->US_MR & ~(US_MR_PAR_Msk)) | US_MR_PAR_NO;
            }

            /* Enable receiver and transmitter */
            enable();

        };

        void setInterrupts(const uint16_t interrupts) {
            if (interrupts != UARTInterrupt::Off) {

                if (interrupts & UARTInterrupt::OnRxDone) {
                    usart()->US_IER = US_IER_RXRDY;
                } else {
                    usart()->US_IDR = US_IDR_RXRDY;
                }
                if (interrupts & UARTInterrupt::OnTxDone) {
                    usart()->US_IER = US_IER_TXRDY;
                } else {
                    usart()->US_IDR = US_IDR_TXRDY;
                }

