synthetos/Motate/MotateProject/motate/Atmel_sam4e/SamUART.h
                if (interrupts & UARTInterrupt::OnRxTransferDone) {
                    usart()->US_IER = US_IER_RXBUFF;
                } else {
                    usart()->US_IDR = US_IDR_RXBUFF;
                }
                if (interrupts & UARTInterrupt::OnTxTransferDone) {
                    usart()->US_IER = US_IER_TXBUFE;
                } else {
                    usart()->US_IDR = US_IDR_TXBUFE;
                }


                /* Set interrupt priority */
                if (interrupts & UARTInterrupt::PriorityHighest) {
                    NVIC_SetPriority(usartIRQ(), 0);
                }
                else if (interrupts & UARTInterrupt::PriorityHigh) {
                    NVIC_SetPriority(usartIRQ(), 3);
                }
                else if (interrupts & UARTInterrupt::PriorityMedium) {
                    NVIC_SetPriority(usartIRQ(), 7);
                }
                else if (interrupts & UARTInterrupt::PriorityLow) {
                    NVIC_SetPriority(usartIRQ(), 11);
                }
                else if (interrupts & kInterruptPriorityLowest) {
                    NVIC_SetPriority(usartIRQ(), 15);
                }

                NVIC_EnableIRQ(usartIRQ());
            } else {

                NVIC_DisableIRQ(usartIRQ());
            }
        };

        void setInterruptHandler(std::function<void(uint16_t)> &&handler) {
            _uartInterruptHandler = std::move(handler);
        }

        void _setInterruptTxReady(bool value) {
            if (value) {
                usart()->US_IER = US_IER_TXRDY;
            } else {
                usart()->US_IDR = US_IDR_TXRDY;
            }
        };

        void _setInterruptRxReady(bool value) {
            if (value) {
                usart()->US_IER = US_IER_RXRDY;
            } else {
                usart()->US_IDR = US_IDR_RXRDY;
            }
        };

        void _setInterruptCTSChange(bool value) {
            if (value) {
                usart()->US_IER = US_IER_CTSIC;
            } else {
                usart()->US_IDR = US_IDR_CTSIC;
            }
        };

        void _setInterruptTxTransferDone(bool value) {
            if (value) {
                usart()->US_IER = US_IER_TXBUFE;
            } else {
                usart()->US_IDR = US_IDR_TXBUFE;
            }
        };

        void _setInterruptRxTransferDone(bool value) {
            if (value) {
                usart()->US_IER = US_IER_RXBUFF;
            } else {
                usart()->US_IDR = US_IDR_RXBUFF;
            }
        };

        static uint16_t getInterruptCause() { // __attribute__ (( noinline ))
            uint16_t status = UARTInterrupt::Unknown;

            // Notes from experience:
            // This processor will sometimes allow one of these bits to be set,
            // even when there is no interrupt requested, and the setup conditions
            // don't appear to be done.
            // The simple but unfortunate fix is to verify that the Interrupt Mask
            // calls for that interrupt before considering it as a possible interrupt
            // source. This should be a best practice anyway, really. -Giseburt

            auto US_CSR_hold = usart()->US_CSR;
            auto US_IMR_hold = usart()->US_IMR;
            if ((US_IMR_hold & US_IMR_TXRDY) && (US_CSR_hold & US_CSR_TXRDY))
            {
                status |= UARTInterrupt::OnTxReady;
            }
            if ((US_IMR_hold & US_IMR_TXBUFE) && (US_CSR_hold & US_CSR_TXBUFE))
            {
                status |= UARTInterrupt::OnTxTransferDone;
            }
            if ((US_IMR_hold & US_IMR_RXRDY) && (US_CSR_hold & US_CSR_RXRDY))
            {
                status |= UARTInterrupt::OnRxReady;
            }
            if ((US_IMR_hold & US_IMR_RXBUFF) && (US_CSR_hold & US_CSR_RXBUFF))
            {
                status |= UARTInterrupt::OnRxTransferDone;
            }
            if ((US_IMR_hold & US_IMR_CTSIC) && (US_CSR_hold & US_CSR_CTSIC))
            {
                status |= UARTInterrupt::OnCTSChanged;
            }
            return status;
        }

        int16_t readByte() {
            if (usart()->US_CSR & US_CSR_RXRDY) {
                return (usart()->US_RHR & US_RHR_RXCHR_Msk);
            }
            return -1;
        };

        int16_t writeByte(const char value) {
            if (usart()->US_CSR & US_CSR_TXRDY) {
                usart()->US_THR = US_THR_TXCHR(value);
            }
            return -1;
        };

        void flush() {
            // Wait for the buffer to be empty
            while (!usart()->US_CSR & US_CSR_TXEMPTY) {
                ;
            }
        };

        void flushRead() {
            // kill any incoming transfers
            usart()->US_RNCR = 0;
            usart()->US_RCR = 0;
        };


        // ***** Connection status check (simple)
        bool isConnected() {
            // The cts pin allows to know if we're allowed to send,
            // which gives us a reasonable guess, at least.

            // The USART gives us access to that pin.
            return (usart()->US_CSR & US_CSR_CTS) == 0; // active LOW
        };


        // ***** Handle Tranfers
        bool startRXTransfer(char *buffer, const uint16_t length) {
            if (usart()->US_RCR == 0) {
                _setInterruptRxTransferDone(false);
                usart()->US_PTCR = UART_PTCR_RXTDIS; // disable for setup
                usart()->US_RPR = (uint32_t)buffer;
                usart()->US_RCR = length;
                usart()->US_PTCR = UART_PTCR_RXTEN;  // enable again
                _setInterruptRxTransferDone(true);
                return true;
            }
//            else if (usart()->US_RNCR == 0) {
//                usart()->US_RNPR = (uint32_t)buffer;
//                usart()->US_RNCR = length;
//                _setInterruptRxTransferDone(true);
//                return true;
//            }
            return (usart()->US_RPR == (uint32_t)buffer);
        };

        char* getRXTransferPosition() {
            return (char*)usart()->US_RPR;
        };

