synthetos/Motate/MotateProject/motate/Atmel_sam4e/SamUART.h
        bool startTXTransfer(char *buffer, const uint16_t length) {
            if (usart()->US_TCR == 0) {
                _setInterruptTxTransferDone(false);
                usart()->US_PTCR = UART_PTCR_TXTDIS; // disable for setup
                usart()->US_TPR = (uint32_t)buffer;
                usart()->US_TCR = length;
                usart()->US_PTCR = US_PTCR_TXTEN;  // enable again
                _setInterruptTxTransferDone(true);
                return true;
            }
//            else if (usart()->US_TNCR == 0) {
//                usart()->US_TNPR = (uint32_t)buffer;
//                usart()->US_TNCR = length;
//                _setInterruptTxTransferDone(true);
//                return true;
//            }
            return (usart()->US_TPR == (uint32_t)buffer);;
        };

        char* getTXTransferPosition() {
            return (char*)usart()->US_TPR;
        };

    };


    // UART peripheral
    template<uint8_t uartPeripheralNumber>
    struct _UARTHardware {

        static constexpr Uart * const uart() {
            return (uartPeripheralNumber == 0) ? UART0 : UART1;
        };
        static constexpr uint32_t peripheralId() {
            return (uartPeripheralNumber == 0) ? ID_UART0 : ID_UART1;
        };
        static constexpr IRQn_Type uartIRQ() {
            return (uartPeripheralNumber == 0) ? UART0_IRQn : UART1_IRQn;
        };

        static constexpr const uint8_t uartPeripheralNum=uartPeripheralNumber;

        typedef _UARTHardware<uartPeripheralNumber> this_type_t;
        

        static std::function<void(uint16_t)> _uartInterruptHandler;

        void init() {
            // init is called once after reset, so clean up after a reset
            SamCommon::enablePeripheralClock(peripheralId());

            // Reset and disable TX and RX
            uart()->UART_CR = UART_CR_RSTRX | UART_CR_RSTTX | UART_CR_RXDIS | UART_CR_TXDIS;

            // reset PCR to zero
            //uart()->UART_IDR = 0xffffffff; // disable all the things
            uart()->UART_PTCR = UART_PTCR_RXTDIS | UART_PTCR_TXTDIS; // disable all the things
            uart()->UART_RPR = 0;
            uart()->UART_RNPR = 0;
            uart()->UART_RCR = 0;
            uart()->UART_RNCR = 0;
            uart()->UART_TPR = 0;
            uart()->UART_TNPR = 0;
            uart()->UART_TCR = 0;
            uart()->UART_TNCR = 0;
        };

        _UARTHardware() {
            // We DON'T init here, because the optimizer is fickle, and will remove this whole area.
            // Instead, we call init from UART<>::init(), so that the optimizer will keep it.
        };

        void enable() { uart()->UART_CR = UART_CR_TXEN | UART_CR_RXEN; };
        void disable () { uart()->UART_CR = UART_CR_TXDIS | UART_CR_RXDIS; };

        void setOptions(const uint32_t baud, const uint16_t options, const bool fromConstructor=false) {
            disable();

            // Oversampling is either 8 or 16. Depending on the baud, we may need to select 8x in
            // order to get the error low.

            uart()->UART_BRGR = UART_BRGR_CD(SystemCoreClock / (16 * baud));

            // No hardware flow control
            // if (options & UARTMode::RTSCTSFlowControl) {
            // } else {
            // }

            // Only 1 stop bit
            // if (options & UARTMode::TwoStopBits) {
            // } else {
            // }

            // Only 8-bit mode
            // if (options & UARTMode::As9Bit) {
            // } else {
            // }

            if (options & UARTMode::EvenParity) {
                uart()->UART_MR = (uart()->UART_MR & ~(UART_MR_PAR_Msk)) | UART_MR_PAR_EVEN;
            } else if (options & UARTMode::OddParity) {
                uart()->UART_MR = (uart()->UART_MR & ~(UART_MR_PAR_Msk)) | UART_MR_PAR_ODD;
            } else {
                uart()->UART_MR = (uart()->UART_MR & ~(UART_MR_PAR_Msk)) | UART_MR_PAR_NO;
            }

            /* Enable receiver and transmitter */
            enable();

        };

        void setInterrupts(const uint16_t interrupts) {
            if (interrupts != UARTInterrupt::Off) {

                if (interrupts & UARTInterrupt::OnRxDone) {
                    uart()->UART_IER = UART_IER_RXRDY;
                } else {
                    uart()->UART_IDR = UART_IDR_RXRDY;
                }
                if (interrupts & UARTInterrupt::OnTxDone) {
                    uart()->UART_IER = UART_IER_TXRDY;
                } else {
                    uart()->UART_IDR = UART_IDR_TXRDY;
                }

                if (interrupts & UARTInterrupt::OnRxTransferDone) {
                    uart()->UART_IER = UART_IER_RXBUFF;
                } else {
                    uart()->UART_IDR = UART_IDR_RXBUFF;
                }
                if (interrupts & UARTInterrupt::OnTxTransferDone) {
                    uart()->UART_IER = UART_IER_TXBUFE;
                } else {
                    uart()->UART_IDR = UART_IDR_TXBUFE;
                }


                /* Set interrupt priority */
                if (interrupts & UARTInterrupt::PriorityHighest) {
                    NVIC_SetPriority(uartIRQ(), 0);
                }
                else if (interrupts & UARTInterrupt::PriorityHigh) {
                    NVIC_SetPriority(uartIRQ(), 3);
                }
                else if (interrupts & UARTInterrupt::PriorityMedium) {
                    NVIC_SetPriority(uartIRQ(), 7);
                }
                else if (interrupts & UARTInterrupt::PriorityLow) {
                    NVIC_SetPriority(uartIRQ(), 11);
                }
                else if (interrupts & kInterruptPriorityLowest) {
                    NVIC_SetPriority(uartIRQ(), 15);
                }

                NVIC_EnableIRQ(uartIRQ());
            } else {

                NVIC_DisableIRQ(uartIRQ());
            }
        };

        void setInterruptHandler(std::function<void(uint16_t)> &&handler) {
            _uartInterruptHandler = std::move(handler);
        }

        void _setInterruptTxReady(bool value) {
            if (value) {
                uart()->UART_IER = UART_IER_TXRDY;
            } else {
                uart()->UART_IDR = UART_IDR_TXRDY;
            }
        };

        void _setInterruptRxReady(bool value) {
            if (value) {
                uart()->UART_IER = UART_IER_RXRDY;
            } else {
                uart()->UART_IDR = UART_IDR_RXRDY;
            }
        };

        void _setInterruptCTSChange(bool value) {
            if (value) {
            } else {
            }
        };

        void _setInterruptTxTransferDone(bool value) {
            if (value) {
                uart()->UART_IER = UART_IER_TXBUFE;
            } else {
                uart()->UART_IDR = UART_IDR_TXBUFE;
            }
        };

        void _setInterruptRxTransferDone(bool value) {
            if (value) {
                uart()->UART_IER = UART_IER_RXBUFF;
            } else {
                uart()->UART_IDR = UART_IDR_RXBUFF;
            }
        };

        static uint16_t getInterruptCause() { // __attribute__ (( noinline ))
            uint16_t status = UARTInterrupt::Unknown;

            // Notes from experience:
            // This processor will sometimes allow one of these bits to be set,
            // even when there is no interrupt requested, and the setup conditions
            // don't appear to be done.
            // The simple but unfortunate fix is to verify that the Interrupt Mask
            // calls for that interrupt before considering it as a possible interrupt
            // source. This should be a best practice anyway, really. -Giseburt

            auto UART_SR_hold = uart()->UART_SR;
            auto UART_IMR_hold = uart()->UART_IMR;
            if ((UART_IMR_hold & UART_IMR_TXRDY) && (UART_SR_hold & UART_SR_TXRDY))
            {
                status |= UARTInterrupt::OnTxReady;
            }
            if ((UART_IMR_hold & UART_IMR_TXBUFE) && (UART_SR_hold & UART_SR_TXBUFE))
            {
                status |= UARTInterrupt::OnTxTransferDone;
            }
            if ((UART_IMR_hold & UART_IMR_RXRDY) && (UART_SR_hold & UART_SR_RXRDY))
            {
                status |= UARTInterrupt::OnRxReady;
            }
            if ((UART_IMR_hold & UART_IMR_RXBUFF) && (UART_SR_hold & UART_SR_RXBUFF))
            {
                status |= UARTInterrupt::OnRxTransferDone;
            }
            return status;
        }

        int16_t readByte() {
            while (!(uart()->UART_SR & UART_SR_RXRDY)) { ; }
            return (uart()->UART_RHR & UART_RHR_RXCHR_Msk);
        };

        int16_t writeByte(const char value) {
            while (!(uart()->UART_SR & UART_SR_TXRDY)) { ; }
            uart()->UART_THR = UART_THR_TXCHR(value);
            return 1;
        };

        void flush() {
            // Wait for the buffer to be empty
            while (!(uart()->UART_SR & UART_SR_TXEMPTY)) {
                ;
            }
        };

        void flushRead() {
            // kill any incoming transfers
            uart()->UART_RNCR = 0;
            uart()->UART_RCR = 0;
        };


        // ***** Connection status check (simple)
        bool isConnected() {
            // The cts pin allows to know if we're allowed to send,
            // which gives us a reasonable guess, at least.

            // read the CTS pin
            return true; // assume always for now
        };


