synthetos/Motate/MotateProject/motate/Atmel_sam4e/SamUART.h
        // ***** Handle Tranfers
        bool startRXTransfer(char *buffer, const uint16_t length) {
            if (uart()->UART_RCR == 0) {
                _setInterruptRxTransferDone(false);
                uart()->UART_PTCR = UART_PTCR_RXTDIS; // disable for setup
                uart()->UART_RPR = (uint32_t)buffer;
                uart()->UART_RCR = length;
                if (length != 0) {
                    _setInterruptRxTransferDone(true);
                    uart()->UART_PTCR = UART_PTCR_RXTEN;  // enable again
                    return true;
                }
//                __asm__("BKPT"); // ("length was zero in startRXTransfer");
                return false;
            }
//            else if (uart()->UART_RNCR == 0) {
//                uart()->UART_RNPR = (uint32_t)buffer;
//                uart()->UART_RNCR = length;
//                _setInterruptRxTransferDone(true);
//                return true;
//            }
            // return true is this same transaction has already been setup

//            __asm__("BKPT"); // ("UART_RCR wasn't zero when startRXTransfer called");
            return (uart()->UART_RPR == (uint32_t)buffer);
        };

        char* getRXTransferPosition() {
            return (char*)uart()->UART_RPR;
        };

        bool startTXTransfer(char *buffer, const uint16_t length) {
            if (uart()->UART_TCR == 0) {
                _setInterruptTxTransferDone(false);
                uart()->UART_PTCR = UART_PTCR_TXTDIS; // disable for setup
                uart()->UART_TPR = (uint32_t)buffer;
                uart()->UART_TCR = length;
                _setInterruptTxTransferDone(true);
                uart()->UART_PTCR = UART_PTCR_TXTEN;  // enable again
                return true;
            }
//            else if (uart()->UART_TNCR == 0) {
//                uart()->UART_TNPR = (uint32_t)buffer;
//                uart()->UART_TNCR = length;
//                _setInterruptTxTransferDone(true);
//                return true;
//            }

//            __asm__("BKPT"); // ("UART_TCR wasn't zero when startTXTransfer called");
            return (uart()->UART_TPR == (uint32_t)buffer);
        };
        
        char* getTXTransferPosition() {
            return (char*)uart()->UART_TPR;
        };
        
    };

    template<uint8_t uartPeripheralNumber>
    using _USART_Or_UART = typename std::conditional<uartPeripheralNumber < 4, _USARTHardware<uartPeripheralNumber>, _UARTHardware<uartPeripheralNumber-4>>::type;

    template<pin_number rxPinNumber, pin_number txPinNumber>
    using UARTGetHardware = typename std::conditional<
        IsUARTRxPin<rxPinNumber>() &&
        IsUARTTxPin<txPinNumber>() &&
        rxPinNumber != txPinNumber &&
        UARTTxPin<txPinNumber>::uartNum == UARTRxPin<rxPinNumber>::uartNum,
        /* True:  */ _USART_Or_UART<UARTTxPin<txPinNumber>::uartNum>,
        /* False: */ _UARTHardware<0xff> // static_assert below should prevent this
    >::type;

    template<pin_number rtsPinNumber, pin_number rxPinNumber>
    constexpr const bool isRealAndCorrectRTSPin() {
        return IsUARTRTSPin<rtsPinNumber>() && (UARTRTSPin<rtsPinNumber>::uartNum == UARTRxPin<rxPinNumber>::uartNum);
    }
    template<pin_number ctsPinNumber, pin_number rxPinNumber>
    constexpr const bool isRealAndCorrectCTSPin() {
        return IsUARTCTSPin<ctsPinNumber>() && (UARTCTSPin<ctsPinNumber>::uartNum == UARTRxPin<rxPinNumber>::uartNum);
    }

//    template<uint8_t uartPeripheralNumber>
//    struct _UARTHardwareProxy {
//    };


//    template<uint8_t uartPeripheralNumber, pin_number rtsPinNumber, pin_number ctsPinNumber, typename rxBufferClass, typename txBufferClass>
//    struct _BufferedUARTHardware : _UARTHardware<uartPeripheralNumber> {
//        rxBufferClass rxBuffer;
//        txBufferClass txBuffer;
//
//        OutputPin<rtsPinNumber> rtsPin;
//        IRQPin<ctsPinNumber> ctsPin;
//
//        uint32_t txDelayAfterResume = 3;
//        uint32_t txDelayUntilTime   = 0;
//
//        bool _rtsCtsFlowControl    = false;
//        bool _xonXoffFlowControl   = false;
//        volatile bool _xonXoffCanSend       = true;
//        volatile char _xonXoffStartStop     = kUARTXOn;
//        volatile bool _xonXoffStartStopSent = true;
//
//        typedef _UARTHardware<uartPeripheralNumber> parent;
//
//        _BufferedUARTHardware() {
//        };
//
//        void init() {
//            parent::init();
//            parent::setInterrupts(UARTInterrupt::OnRxReady | UARTInterrupt::PriorityLowest);
//            _UARTHardwareProxy<uartPeripheralNumber>::uartInterruptHandler = [&](uint16_t interruptCause) { // use a closure
//                uartInterruptHandler(interruptCause);
//            };
//        };
//
//        void setOptions(const uint32_t baud, const uint16_t options, const bool fromConstructor=false) {
//            parent::setOptions(baud, options, fromConstructor);
//
//            if (options & UARTMode::RTSCTSFlowControl && IsIRQPin<ctsPinNumber>() && !rtsPin.isNull()) {
//                _rtsCtsFlowControl = true;
////                parent::setInterruptTxReady(!canSend());
//                ctsPin.setInterrupts(kPinInterruptOnChange);
//            } else {
//                _rtsCtsFlowControl = false;
//            }
////            if (options & UARTMode::XonXoffFlowControl) {
////                _xonXoffFlowControl = true;
////            } else {
////                _xonXoffFlowControl = false;
////                _xonXoffStartStopSent = true;
////            }
//        }
//
////        void stopRx() {
////            if (_rtsCtsFlowControl) {
////                rtsPin = true;
////            }
////            if (_xonXoffFlowControl && _xonXoffStartStop != kUARTXOff) {
////                _xonXoffStartStop = kUARTXOff;
////                _xonXoffStartStopSent = false;
////                parent::setInterruptTxReady(true);
////            }
////        };
////
////        void startRx() {
////            if (_rtsCtsFlowControl) {
////                rtsPin = false;
////            }
////            if (_xonXoffFlowControl && _xonXoffStartStop != kUARTXOn) {
////                _xonXoffStartStop = kUARTXOn;
////                _xonXoffStartStopSent = false;
////                parent::setInterruptTxReady(true);
////            }
////        };
//
////        bool canSend() {
////            if (_rtsCtsFlowControl) {
////                return !ctsPin;
////            }
////            if (_xonXoffFlowControl) {
////                return _xonXoffCanSend;
////            }
////            return true;
////        };
//
//        void setTxDelayAfterResume(uint32_t newDelay) { txDelayAfterResume = newDelay; };
//
//        int16_t readByte() {
//            return rxBuffer.read();
//        };
//
//        int16_t writeByte(const uint8_t data) {
//            int16_t ret = txBuffer.write(data);
//            return ret;
//        };
//
//        void uartInterruptHandler(uint16_t interruptCause) {
////            if ((interruptCause & (UARTInterrupt::OnTxReady /*| UARTInterrupt::OnTxDone*/))) {
////                if (txDelayUntilTime && SysTickTimer.getValue() < txDelayUntilTime)
////                    return;
////                txDelayUntilTime = 0;
////                if (_xonXoffFlowControl) {
////                    if (_xonXoffStartStopSent == false) {
////                        parent::writeByte(_xonXoffStartStop);
////                        _xonXoffStartStopSent = true;
////                        return;
////                    }
////                }
////                int16_t value = txBuffer.read();
////                if (value >= 0) {
////                    parent::writeByte(value);
////                }
////            }
////            if (txBuffer.isEmpty() || txBuffer.isLocked()) {
////                // This is tricky: If it's write locked, we have to bail, and SHUT OFF TxReady interrupts.
////                // On the ARM, it won't return to the main code as long as there's a pending interrupt,
////                // and the txReady interrupt will continue to fire, causing deadlock.
////                parent::setInterruptTxReady(false);
////            }
////
////            if ((interruptCause & UARTInterrupt::OnRxReady) && !rxBuffer.isFull()) {
////                int16_t value = parent::readByte();
////                if (_xonXoffFlowControl) {
////                    if (value == kUARTXOn) {
////                        _xonXoffCanSend = true;
////                        return;
////                    } else if (value == kUARTXOff) {
////                        _xonXoffCanSend = false;
////                        return;
////                    }
////                }
////                // We don't double check to ensure value is not -1 -- should we?
////                rxBuffer.write(value);
////                if (rxBuffer.available() < 4) {
////                    stopRx();
////                }
////            }
//        };
//
////        void pinChangeInterrupt() {
////            txDelayUntilTime = SysTickTimer.getValue() + txDelayAfterResume;
////            parent::setInterruptTxReady(canSend());
////        };
//
//        void flush() {
//            // Wait for the buffer to be empty...
//            while(!txBuffer.isEmpty());
//        };
//    };



//    template<pin_number rxPinNumber, pin_number txPinNumber, pin_number rtsPinNumber = -1, pin_number ctsPinNumber = -1, typename rxBufferClass = Buffer<128>, typename txBufferClass = rxBufferClass>
//    struct BufferedUART {
//        UARTRxPin<rxPinNumber> rxPin;
//        UARTTxPin<txPinNumber> txPin;
//
//
//        _BufferedUARTHardware< UARTGetHardware<rxPinNumber, txPinNumber>::uartPeripheralNum, rtsPinNumber, ctsPinNumber, rxBufferClass, txBufferClass > hardware;
//
//
//        const uint8_t uartPeripheralNum() { return hardware.uartPeripheralNum; };
//
//        BufferedUART(const uint32_t baud = 115200, const uint16_t options = UARTMode::As8N1) {
//            hardware.init();
//            init(baud, options, /*fromConstructor =*/ true);
//        };
//
//        void init(const uint32_t baud, const uint16_t options, const bool fromConstructor=false) {
//            setOptions(baud, options, fromConstructor);
//        };
//
//        void setOptions(const uint32_t baud, const uint16_t options, const bool fromConstructor=false) {
//            hardware.setOptions(baud, options, fromConstructor);
//        };
//
//
//
//        int16_t readByte() {
//            return hardware.readByte();
//        };
//
//        // WARNING: Currently only reads in bytes. For more-that-byte size data, we'll need another call.
//        int16_t read(const uint8_t *buffer, const uint16_t length) {
//            int16_t total_read = 0;
//            int16_t to_read = length;
//            const uint8_t *read_ptr = buffer;
//
//            // BLOCKING!!
//            while (to_read > 0) {
//                int16_t ret = hardware.readByte();
//
//                if (ret >= 0) {
//                    *read_ptr++ = ret;
//                    total_read++;
//                    to_read--;
//                }
//            };
//
//            return total_read;
//        };
//
//        int16_t writeByte(uint8_t data) {
//            return hardware.writeByte(data);
//        };
//
//        void flush() {
//            hardware.flush();
//        };
//
//        // WARNING: Currently only writes in bytes. For more-that-byte size data, we'll need another call.
//        int16_t write(const char* data, const uint16_t length = 0, bool autoFlush = false) {
//            int16_t total_written = 0;
//            const char* out_ptr = data;
//            int16_t to_write = length;
//
//            if (length==0 && *out_ptr==0) {
//                return 0;
//            }
//
//            do {
//                int16_t ret = hardware.writeByte(*out_ptr);
//
//                if (ret > 0) {
//                    out_ptr++;
//                    total_written++;
//                    to_write--;
//
//                    if (length==0 && *out_ptr==0) {
//                        break;
//                    }
//                } else if (autoFlush) {
//                    flush();
//                } else {
//                    break;
//                }
//            } while (to_write);
//
//            if (autoFlush && total_written > 0)
//                flush();
//
//            return total_written;
//        };
//
//        template<uint16_t _size>
//        int16_t write(Motate::Buffer<_size> &data, const uint16_t length = 0, bool autoFlush = false) {
//            int16_t total_written = 0;
//            int16_t to_write = length;
//
//            do {
//                int16_t value = data.peek();
//                if (value < 0) // no more data
//                    break;
//
//                int16_t ret = hardware.writeByte(value);
//                if (ret > 0) {
//                    data.pop();
//                    to_write--;
//                } else if (autoFlush) {
//                    flush();
//                } else {
//                    break;
//                }
//            } while (to_write != 0);
//
//            if (autoFlush && total_written > 0)
//                flush();
//
//            return total_written;
//        };
//
//        void pinChangeInterrupt() {
//            hardware.pinChangeInterrupt();
//        };
//
//        //	// Placeholder for user code.
//        //	static void interrupt() __attribute__ ((weak));
//    };
}

#endif /* end of include guard: SAM4XUART_H_ONCE */
